app/views/videos/show.html.erb


<% if @video.comments.blank? %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."video_id" = 1