app/controllers/comments_controller.rb

SELECT "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT 1  [["id", "4"]]
---
  def show
    @comment = Comment.find(params[:id])

SELECT "videos".* FROM "videos" WHERE "videos"."id" = ? LIMIT 1  [["id", "1"]]
INSERT INTO "comments" ("comment", "created_at", "dislikes", "likes", "updated_at", "video_id") VALUES (?, ?, ?, ?, ?, ?)  [["comment", "nice!"], ["created_at", Mon, 25 Nov 2013 23:11:41 UTC +00:00], ["dislikes", nil], ["likes", nil], ["updated_at", Mon, 25 Nov 2013 23:11:41 UTC +00:00], ["video_id", nil]]
---
  def create
    @video = Video.find(params[:video_id])

    if params[:comment].blank?
      flash[:error] = "Comentario nao adicionado. Inserir pelo menos um caracter."
      redirect_to @video
    else
      @comment = Comment.new(:comment => params[:comment], :video_id => params[:video_id], :dislikes => 0, :likes => 0)
      @comment.save

SELECT "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT 1  [["id", "4"]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 4]]
---
  def destroy
    @comment = Comment.find(params[:id])
    @comment.destroy

SELECT "videos".* FROM "videos" WHERE "videos"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT 1  [["id", "14"]]
UPDATE "comments" SET "likes" = 1, "updated_at" = '2013-11-26 09:12:21.036496' WHERE "comments"."id" = 14
---
  def clike
    @video = Video.find(params[:video_id])
    @comment = Comment.find(params[:comment_id])
    @comment.increment!(:likes)

SELECT "videos".* FROM "videos" WHERE "videos"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT 1  [["id", "14"]]
UPDATE "comments" SET "dislikes" = 1, "updated_at" = '2013-11-26 09:12:29.088957' WHERE "comments"."id" = 14
---
  def cdislike
    @video = Video.find(params[:video_id])
    @comment = Comment.find(params[:comment_id])
    @comment.increment!(:dislikes)