app/controllers/general_controller.rb

SELECT "videos".* FROM "videos" WHERE (title like '%ad%') ORDER BY title ASC
---
  def search
                    if !params[:q].blank?
                      @list = Video.where('title like ?', '%'+params[:q]+'%').order('title ASC');