app/controllers/videos_controller.rb

  def show

    @video = Video.find(params[:id])
    @video.increment!(:views)

    if user_signed_in?
      dob = current_user.date_of_birth
      now = Time.now.utc.to_date
      @idd = now.year - dob.year - ((now.month > dob.month || (now.month == dob.month && now.day >= dob.day)) ? 0 : 1)

      @evaluation = Evaluation.find_by_user_and_video_id(current_user.email, params[:id])
    end

    @related_videos = Video.find_all_by_category(@video.category)

    @comments = @video.comments
    @comments = @comments.paginate(:page => params[:page], :per_page => 5)
---
SELECT "comments".* FROM "comments" WHERE "comments"."video_id" = 1