app/controllers/videos_controller.rb

SELECT "videos".* FROM "videos"
---
  def index
    @videos = Video.all

SELECT "videos".* FROM "videos" WHERE "videos"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "videos" SET "views" = 1, "updated_at" = '2013-11-25 21:02:40.422582' WHERE "videos"."id" = 1
SELECT "videos".* FROM "videos" WHERE "videos"."category" = 'Movies'
---
  def show

    @video = Video.find(params[:id])
    @video.increment!(:views)
    @related_videos = Video.find_all_by_category(@video.category)

SELECT "videos".* FROM "videos" WHERE "videos"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "videos" SET "likes" = 401, "updated_at" = '2013-11-25 21:37:52.456384' WHERE "videos"."id" = 1
---
  def like
    @video = Video.find(params[:video_id])
    @video.increment!(:likes)

SELECT "videos".* FROM "videos" WHERE "videos"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "videos" SET "dislikes" = 1, "updated_at" = '2013-11-25 23:04:07.370372' WHERE "videos"."id" = 1
---
  def dislike
    @video = Video.find(params[:video_id])
    @video.increment!(:dislikes)